; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-2-2-3-5) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 distributor0)
	(clear crate2)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(at crate2 distributor0)
	(on crate2 crate1)
	(at crate3 depot0)
	(on crate3 crate0)
	(at crate4 depot0)
	(on crate4 crate3)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 crate4)
		(on crate2 pallet1)
		(on crate3 crate1)
		(on crate4 crate2)
	)
))

; plan
1. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 crate3) (clear crate4)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 1 of 5
2. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 1 of 5
3. (lift hoist0 crate3 crate0 depot0)
   deleted: (at crate3 depot0) (available hoist0) (on crate3 crate0) (clear crate3)
   added: (lifting hoist0 crate3) (clear crate0)
   goals met: 1 of 5
4. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   goals met: 1 of 5
5. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (available hoist1) (on crate2 crate1) (clear crate2)
   added: (lifting hoist1 crate2) (clear crate1)
   goals met: 1 of 5
6. (lift hoist2 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (available hoist2) (on crate1 pallet1) (clear crate1)
   added: (lifting hoist2 crate1) (clear pallet1)
   goals met: 1 of 5
7. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (at crate2 distributor0) (available hoist1) (on crate2 pallet1) (clear crate2)
   goals met: 2 of 5
8. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 2 of 5
9. (unload hoist1 crate4 truck1 distributor0)
   deleted: (available hoist1) (in crate4 truck1)
   added: (lifting hoist1 crate4)
   goals met: 2 of 5
10. (drop hoist1 crate4 crate2 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate2)
   added: (at crate4 distributor0) (available hoist1) (on crate4 crate2) (clear crate4)
   goals met: 3 of 5
11. (drop hoist2 crate1 crate4 distributor0)
   deleted: (lifting hoist2 crate1) (clear crate4)
   added: (at crate1 distributor0) (available hoist2) (on crate1 crate4) (clear crate1)
   goals met: 4 of 5
12. (unload hoist1 crate3 truck1 distributor0)
   deleted: (available hoist1) (in crate3 truck1)
   added: (lifting hoist1 crate3)
   goals met: 4 of 5
13. (drop hoist1 crate3 crate1 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate1)
   added: (at crate3 distributor0) (available hoist1) (on crate3 crate1) (clear crate3)
   goals met: 5 of 5
